Repository: karolNiedziela/SharedHome
Catalog: API/src/SharedHome.Api/Resources/SharedHomeExceptionMessage.*.resx
Languages: pl_pl

# BillNotFound
source: Bill was not found.
pl_pl: Rachunek nie został znaleziony.

# BillNotPaid
source: Bill has not been paid yet.
pl_pl: Rachunek nie został jeszcze opłacony.

# BillPaid
source: Bill is already paid.
pl_pl: Rachunek został już opłacony.

# EmailAlreadyConfirmed
source: Email address is already confirmed.
pl_pl: Adres email został już potwierdzony.

# EmptyFirstName
source: First name cannot be empty.
pl_pl: Imię nie może być puste.

# EmptyLastName
source: Last name cannot be empty.
pl_pl: Nazwisko nie może być puste.

# EmptyServiceProviderName
source: Service provider name cannot be empty.
pl_pl: Nazwa dostawcy usługi nie może być pusta.

# EmptyShoppingListName
source: Shopping list name cannot be empty.
pl_pl: Nazwa listy zakupów nie może być pusta.

# EmptyShoppingListProductName
source: Shopping list product cannot be empty.
pl_pl: Nazwa produktu nie może być pusta.

# HouseGroupMemberIsNotOwner
source: You are not the owner of the home group.
pl_pl: Nie jesteś właścicielem grupy domowej.

source: Invalid credentials.
pl_pl: Niepoprawne dane logowania.

source: Invalid currency.
pl_pl: Nieprawidłowa waluta.

# InvalidEmailAddress
source: Invalid email address format.
pl_pl: Nieprawidłowy format adresu e-mail.

# InvalidEnum
source: Invalid dictionary value.
pl_pl: Niepoprawna wartość słownika.

# InvalidImageFormat
source: Invalid format of image.
pl_pl: Niepoprawny format zdjęcia.

# InvalidRefreshToken
source: Authorization problem.
pl_pl: Problem autoryzacyjny.

# InvitationAccepted
source: Invitation is already accepted.
pl_pl: Zaproszenie zostało już zaakceptowane.

# InvitationAlreadySent
source: Invitation was already sent to giiven person.
pl_pl: Zaproszenie już zostało wysłane do podanej osoby.

# InvitationNotFound
source: Invitation was not found.
pl_pl: Zaproszenie nie zostało znalezione.

# InvitationRejected
source: Invitation is already rejected.
pl_pl: Zaproszenie zostało już odrzucone.

# MoneyAmountBelowZero
source: Price/Cost cannot be lower than zero.
pl_pl: Cena/Koszt nie może być mniejszy niż zero.

# PersonIsAlreadyInHouseGroup
source: Person is already in another house group.
pl_pl: Osoba już znajduje się w innej grupie domowej.

# PersonIsNotInHouseGroup
source: Person is not in given house group.
pl_pl: Osoba nie znajduje się w podanej grupie domowej.

# PersonWithEmailNotFound
source: The person with the specified e-mail address was not found.
pl_pl: Osoba z podanym adresem e-mail nie została znaleziona.

# QuantityBelowZero
source: Quantity cannot be lower than zero.
pl_pl: Ilość nie może być mniejsza niż zero.

# RefreshTokenExpired
source: Authorization problem.
pl_pl: Problem autoryzacyjny.

# ShoppingListAlreadyDone
source: Shopping list is already done.
pl_pl: Lista zakupów została już wykonana.

# ShoppingListNotFound
source: Shopping list was not found.
pl_pl: Lista zakupów nie została znaleziona.

# ShoppingListProductAlreadyExists
source: Shopping list product with name '{0}' already added to list.
pl_pl: Produkt o nazwie '{0}' już został dodany do listy.

# ShoppingListProductIsAlreadyBought
source: Shopping list product '{0}' is already bought.
pl_pl: Produkt '{0}' został już zakupiony.

# ShoppingListProductNotFound
source: Shopping list product was not found.
pl_pl: Produkt nie został znaleziony.

# ShoppingListProductWasNotBought
source: Shopping list product '{0}' was not bought.
pl_pl: Produkt '{0}' nie został zakupiony.

# TooLongHouseGroupName
source: Name cannot be longer than '{maxLength}' characters.
pl_pl: Nazwa nie może być dłuższa niż '{0}' znaków.

# TooLongShoppingListNameException
source: Name can contain maximum '{0}' characters.
pl_pl: Nazwa może zawierać maksymalnie '{0}' znaków.

# TotalMembersLimitReached
source: Max members limit reached. Limit is '{0}'.
pl_pl: Maksymalny limit członków został osiągniety. Limit wynosi '{0}'.

# UnsupportedCurrency
source: Given currency is unsupported.
pl_pl: Podana waluta jest niewspierana.

# UserNotFound
source: User was not found.
pl_pl: Użytkownik nie został znaleziony
